tests/loadtests/artillery/delete-content.yml
# variables can be set by env vars: https://artillery.io/docs/guides/guides/test-script-reference.html#Using-dynamic-values-in-config

config:
  defaults:
    cookie:
      UMB_UCONTEXT: ""
  variables:
    backOfficeApiPath: "/umbraco/backoffice/UmbracoApi"
  processor: "./content.js"
  http:
    # 15 second http timeout (which is very high!)
    timeout: 15
  phases:
    - duration: 1
      arrivalRate: 1
scenarios:
  - name: "Delete content"
    beforeScenario: "configureContentIdsToDelete"
    beforeRequest: "beforeRequest"
    afterResponse:
      - "checkDeleteResponse" # Must run first to check the response code
      - "afterResponse"
    flow:
    - loop:
      - post:
          url: "{{ backOfficeApiPath }}/Content/DeleteById"
          qs:
            id: "{{ contentIdToDelete }}"
          beforeRequest: "configureContentIdToDelete"
      whileTrue: "deleteUntilNoneLeft"